app/views/books/index.html.erb

                  <%= link_to book_favorites_path(book), method: :delete do %>
                    <span class="text-danger"><i class="fas fa-heart"></i><%= book.favorites.count %></span>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

                  <%= link_to book_favorites_path(book), method: :post do %>
                    <span class="text-primary"><i class="fas fa-heart"></i><%= book.favorites.count %></span>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 7]]

            </td>
            <td><p><%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %></p></td>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]