app/views/books/show.html.erb

                  <%= link_to book_favorites_path(@book), method: :delete do %>
                    <span class="text-danger"><i class="fas fa-heart"></i><%= @book.favorites.count %></span>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]

                  <%= link_to book_favorites_path(@book), method: :post do %>
                    <span class="text-primary"><i class="fas fa-heart"></i><%= @book.favorites.count %></span>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

            </td>
            <td>コメント数：<%= @book.book_comments.count %></td>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]

        <tbody>
          <% @book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]