app/controllers/books_controller.rb

  def index
    @user = current_user
    @book = Book.new
    @books = Book.all
---
SELECT "books".* FROM "books"

  def create
    @user = current_user
    @books = Book.all
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "a"], ["body", "aaa"], ["user_id", 3], ["created_at", "2022-06-07 16:22:08.782585"], ["updated_at", "2022-06-07 16:22:08.782585"]]

  def show
    @new_book = Book.new
    @book = Book.find(params[:id])
    @user = User.find(@book.user.id)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]