app/controllers/book_comments_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "commment"], ["user_id", 4], ["book_id", 2], ["created_at", "2022-06-08 15:32:22.805747"], ["updated_at", "2022-06-08 15:32:22.805747"]]
---
  def create
    book = Book.find(params[:book_id]) #id <- book_id
    comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = book.id
    if comment.save

DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 3]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def destroy
    BookComment.find(params[:id]).destroy