app/controllers/users_controller.rb

  def index
    @user = current_user
    @users = User.all
---
SELECT "users".* FROM "users"

  def update
    @user = User.find(current_user.id)
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", ".require(:relationship)"], ["updated_at", "2022-06-08 07:16:34.339261"], ["id", 3]]